//Розробити програму, дотримуючись таких вимог:
// використовувати статичні масиви;
// число n (кількість елементів масиву) – іменована константа;
// елементи масиву – псевдовипадкові числа, згенеровані на інтервалі
//[a, b], де a і b вводяться з клавіатури (a<b);
// усі вхідні дані і також елементи масиву виводяться на екран.

//В одновимірному масиві, що складається з n цілих елементів, обчислити:
//1) мінімальний елемент масиву;
//2) суму елементів масиву, розташованих між першим і останнім додатними
//елементами.
#include <iostream>
using namespace std;
int main(){
  const int n = 7;
  int mas[n];
  int a, b;
  cout<<"Enter a: "; cin>>a;
  cout<<"Enter b: "; cin>>b;
  if (a>=b) {
    int q = a;
    a = b;
    b = q;
  }
  srand(time(NULL));
  cout<<"Проміжок: "<<a<<"; "<<b<<endl;
  cout<<"Масив: ";
  for(int i=0; i<n; i++){
    int random_m =  a + rand() % (b - a + 1);
    mas[i]=random_m;
    cout<<mas[i]<< ' ';
  }
  int min = mas[0];
  for (int j=1; j<n; j++) {
    if (mas[j] < min) {
      min = mas[j];
    }
  }

  int first = 0, last = 1;
  bool first_is_found = false, last_is_found = false;
  int sum = 0;
  for (int k=0; k<n; k++) {
    if (mas[k] > 0) {
      first = k;
      first_is_found = true;
      break;
    }
  }
  for (int k=n-1; k>=0; k--) {
    if (mas[k] > 0) {
      last = k;
      last_is_found = true;
      break;
    }
  }
  cout<<endl<<"Мінімальний елемент: "<<min;
  if (first_is_found == false || last_is_found == false || first == last) {
    cout << endl<< "Немає додатніх елементів, або він тільки один";
  }
  else {
    for (int z = first + 1; z < last; z++) {
      sum += mas[z];
    }
    cout<<endl<<"Сума між першим і останнім додатніми елементами (не включно): "<<sum;
  }
  return 0;
}
/*
Формалізація лаб 6_2
1. Вхідні дані: a, b - вводяться з клавіатури. a має бути менше b.
2. Вихідні дані: проміжок (a;b), згенерований масив, мінімальний елемент масиву і сума між першим і останнім додатніми елементами (не включно).
3. Кількість елементів масиву - іменована константа, я для прикладу беру 7.
4. Створюємо масив.
5. Якщо a більше b, змінюємо їх місцями.
6. В циклі for i від 0 до n з кроком 1 генеруємо випадкове число. Вставляємо це число в масив. Виводимо цей елемент масиву, кожен наступний - через пробіл.
7. Створюємо зміну min для мінімального елементу масиву. Призначаємо перший елемент мінімальним.
8. В циклі for j від 1 до n з кроком 1 перевіряємо, чи елемент масиву з порядковим номером j менший за мінімальний елемент (поки що перший елемент). Якщо так, то це новий мінімальний елемент.
9. У циклі for k від 0 до n з кроком 1 (зліва направо) шукаємо індекс першого додатного елементу. Якщо знайдено - зберігаємо індекс у змінній first, ставимо прапорець first_is_found = true.
10. У циклі for k від n-1 до 0 (включно) з кроком -1 (справа наліво) шукаємо індекс останнього додатного елементу. Якщо знайдено - зберігаємо індекс у змінній last, ставимо прапорець last_is_found = true.
11. Якщо first_is_found == false або last_is_found == false, або first == last, виводимо повідомлення, про те, що немає додатніх елементів, або він тільки один.
12. Інакше в циклі for z від first + 1 до last - 1 додаємо елементи масиву до sum, виводимо її.
*/