//Задача 1. Розробити програму, дотримуючись таких вимог:
//використовувати статичні масиви; максимальні розміри масиву (N i M) –
//статичні константи; реальні розміри масиву n i m (n<N, m<M) – ввести з
//клавіатури (при цьому здійснювати перевірку правильності введення
//даних); елементи масиву – псевдовипадкові числа, згенеровані на інтервалі
//[a, b], де a і b (a<b) вводяться з клавіатури; усі вхідні дані та елементи
//масиву виводити на екран.
//6 Реалізувати програму, яка міняє місцями діагоналі квадратної матриці.
#include <iostream>
#define N 10;
#define M 10;

using namespace std;
int main(){

  return 0;
}