// Написати програму, що дозволяє отримати словесне найменування екзаменаційних оцінок за 100-бальною системою. Using switch
// (90-100 балів - "відмінно", 75-89 - "добре", 60-74 - "задовільно", менше 60 балів - "незадовільно") - 100 сис чис
// 9-10 відмінно, 7.5-8.9 добре, 6.0 - 7.4 - задовільно, <60 - незадовільно.
#include <iostream>
using namespace std;
int main() {
    float grade;
    cout << "Введіть оцінку: "; // Введення оцінки
    cin >> grade; grade = grade/10; // Записуємо у змінну оцінку, ділимо на 10 для зменшення діапазону
    switch (int(grade)) {
        default: cout << "Незадовільно"; break; // Все, що менше 60 - незадовільно
        case 9: case 10: cout << "Відмінно"; break; // Все, що в проміжку 90-100 - відмінно
        case 8: cout << "Добре"; break; // Все, що в проміжку 80-89 - добре
        case 6: cout << "Задовільно"; break; // Все, що в проміжку 60-69 - задовільно
        case 7: // Все, що в проміжку 70-74 - задовільно, 74-79 - добре
            switch (int(grade*10-70)) { // множимо оцінку на 10 і віднімаємо 70, щоб дізнатися останню цифру числа
                case 1: case 2: case 3: case 4: cout <<"Задовільно"; break;
                default: cout <<"Добре"; break;
            } } }